# image要素におけるsizesとsrcsetについて

デバイスの物理的なピクセルサイズと、画像サイズの選択で少しややこしい。
以下の点は先に注意点としてあげておく

- 先に大きな方の画像がbrowserにcacheされている場合はそちらを使う
- iPhoneXはデバイスピクセル比が3倍（物理ピクセル/cssピクセルの比、@2xとかで表現されているやつ）

## sizes属性とsrcset属性

例として以下の要素を考える

```
<img src="foo.png" sizes="600px"
  srcset="
    foo300.png 300w,
    foo600.png 600w,
    foo1200.png 1200w"
>
```

sizesとsrcsetは依存関係はなく、ほぼ直行した機能だと思って良い。

sizes: 表示したいサイズを指定する
srcset: 候補となる画像のURLを指定する

がそれぞれの属性の役割である。

### sizes

直行したとは述べたが、srcsetの選択がw（今だと300wとか600w）で指定されている場合のみ有効。
メディアクエリも書けるので以下のようにすることもできる。

```
     sizes="(max-width: 320px) 280px,
            (max-width: 480px) 440px,
            800px"
```

ここで記載された内容に従い画角が取得される。
今回の場合であれば *600px* が直接指定されているので600pxとなる。


### srcset

今現在600pxが表示する必要がある画角として決定されている。
ではfoo600.pngかfoo1200.pngのどちらを選択するのだろうか。

ここで必要になるのがデバイスピクセル比である。
iPhone6であることを仮定すると

表示したい画角（600px) × 画角（2x） = 1200
となるため `foo1200.png 1200w` が取得するべき画像ということになる。



